app/views/notes/_form.html.erb

SELECT "groups".* FROM "groups"
---

<%= form.hidden_field :group_id, value: current_user.group_id %>