app/views/notes/index.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
          <td><%= note.content %></td>
          <td><%= note.group.name %></td>