app/views/notes/show.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <strong>Group:</strong>
  <%= @note.group.name %>