app/views/devise/registrations/new.html.erb

SELECT "groups".* FROM "groups"
---
    <%= f.label :group_id %><br />
    <%= f.select :group_id, Group.all.map { |group| [group.name, group.id] }, {}, { class: 'form-control' } %>