app/controllers/groups_controller.rb

INSERT INTO "groups" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "third group"], ["created_at", "2023-11-21 19:23:12.612234"], ["updated_at", "2023-11-21 19:23:12.612234"]]
---
    def create
      @group = Group.new(group_params)
      if @group.save

UPDATE "groups" SET "name" = $1, "updated_at" = $2 WHERE "groups"."id" = $3  [["name", "first group"], ["updated_at", "2023-11-21 18:17:20.136089"], ["id", 1]]
---
    def update
      if @group.update(group_params)