app/controllers/notes_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
      unless current_user.groups.include?(@note.group)

INSERT INTO "notes" ("user_id", "group_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["group_id", 1], ["content", "my first note"], ["created_at", "2023-11-22 03:48:52.981224"], ["updated_at", "2023-11-22 03:48:52.981224"]]
---
    def create
      @note = current_user.notes.build(note_params)

      respond_to do |format|
        if @note.save